app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Axel Rowland', 'remityb@mailinator.com', '$2y$12$VD/WY7/2RC.7f0ADxwQo5uLjJEsReDJ5fg/2TZEaPqJTY3JKOyQYe', '2024-05-22 05:01:42', '2024-05-22 05:01:42')